require 'config/lang'

question_config = {
	[10001] = { id = 10001,des = "“苍天已死，黄天当立”是哪次起义的口号？", choose = {"黄巾起义","黄花岗起义","宋江起义","赤眉起义"}, correct_answer = 1,},

	[10002] = { id = 10002,des = "“冲关一怒为红颜”说的是谁？", choose = {"吴三桂","耿精忠","安禄山","尚可喜"}, correct_answer = 1,},

	[10003] = { id = 10003,des = "“出生未捷身先死”这是用来描述谁的？", choose = {"项羽","关羽","诸葛亮","文天祥"}, correct_answer = 3,},

	[10004] = { id = 10004,des = "“法律面前人人平等”是哪国人最先提出来的？", choose = {"法国人","英国人","美国人","中国人"}, correct_answer = 1,},

	[10005] = { id = 10005,des = "“佛祖”释迦牟尼来自哪个国家？", choose = {"印度","中国","沙特阿拉伯","越南"}, correct_answer = 1,},

	[10006] = { id = 10006,des = "“花自飘零水自流，一种相思，两处闲愁”是谁的名句?", choose = {"范仲淹","柳永","李清照","辛弃疾"}, correct_answer = 3,},

	[10007] = { id = 10007,des = "“兼爱，非攻”是谁的思想？", choose = {"孔子","老子","墨子","荀子"}, correct_answer = 3,},

	[10008] = { id = 10008,des = "“开元盛世”是我国历史上哪个朝代的盛世？", choose = {"唐朝","宋朝","明朝","清朝"}, correct_answer = 1,},

	[10009] = { id = 10009,des = "“孟德”是下面哪一位历史人物的字号？", choose = {"刘备","曹操","张飞","夏侯惇"}, correct_answer = 2,},

	[10010] = { id = 10010,des = "“破釜沉舟”这个典故说的是谁？", choose = {"项羽","刘邦","关羽","刘备"}, correct_answer = 1,},

	[10011] = { id = 10001,des = "“苍天已死，黄天当立”是哪次起义的口号？", choose = {"黄巾起义","黄花岗起义","宋江起义","赤眉起义"}, correct_answer = 1,},

	[10012] = { id = 10002,des = "“冲关一怒为红颜”说的是谁？", choose = {"吴三桂","耿精忠","安禄山","尚可喜"}, correct_answer = 1,},

	[10013] = { id = 10003,des = "“出生未捷身先死”这是用来描述谁的？", choose = {"项羽","关羽","诸葛亮","文天祥"}, correct_answer = 3,},

	[10014] = { id = 10004,des = "“法律面前人人平等”是哪国人最先提出来的？", choose = {"法国人","英国人","美国人","中国人"}, correct_answer = 1,},

	[10015] = { id = 10005,des = "“佛祖”释迦牟尼来自哪个国家？", choose = {"印度","中国","沙特阿拉伯","越南"}, correct_answer = 1,},

	[10016] = { id = 10006,des = "“花自飘零水自流，一种相思，两处闲愁”是谁的名句?", choose = {"范仲淹","柳永","李清照","辛弃疾"}, correct_answer = 3,},

	[10017] = { id = 10007,des = "“兼爱，非攻”是谁的思想？", choose = {"孔子","老子","墨子","荀子"}, correct_answer = 3,},

	[10018] = { id = 10008,des = "“开元盛世”是我国历史上哪个朝代的盛世？", choose = {"唐朝","宋朝","明朝","清朝"}, correct_answer = 1,},

	[10019] = { id = 10009,des = "“孟德”是下面哪一位历史人物的字号？", choose = {"刘备","曹操","张飞","夏侯惇"}, correct_answer = 2,},

	[10020] = { id = 10010,des = "“破釜沉舟”这个典故说的是谁？", choose = {"项羽","刘邦","关羽","刘备"}, correct_answer = 1,},

	[10021] = { id = 10001,des = "“苍天已死，黄天当立”是哪次起义的口号？", choose = {"黄巾起义","黄花岗起义","宋江起义","赤眉起义"}, correct_answer = 1,},

	[10022] = { id = 10002,des = "“冲关一怒为红颜”说的是谁？", choose = {"吴三桂","耿精忠","安禄山","尚可喜"}, correct_answer = 1,},

	[10023] = { id = 10003,des = "“出生未捷身先死”这是用来描述谁的？", choose = {"项羽","关羽","诸葛亮","文天祥"}, correct_answer = 3,},

	[10024] = { id = 10004,des = "“法律面前人人平等”是哪国人最先提出来的？", choose = {"法国人","英国人","美国人","中国人"}, correct_answer = 1,},

	[10025] = { id = 10005,des = "“佛祖”释迦牟尼来自哪个国家？", choose = {"印度","中国","沙特阿拉伯","越南"}, correct_answer = 1,},

	[10026] = { id = 10006,des = "“花自飘零水自流，一种相思，两处闲愁”是谁的名句?", choose = {"范仲淹","柳永","李清照","辛弃疾"}, correct_answer = 3,},

	[10027] = { id = 10007,des = "“兼爱，非攻”是谁的思想？", choose = {"孔子","老子","墨子","荀子"}, correct_answer = 3,},

	[10028] = { id = 10008,des = "“开元盛世”是我国历史上哪个朝代的盛世？", choose = {"唐朝","宋朝","明朝","清朝"}, correct_answer = 1,},

	[10029] = { id = 10009,des = "“孟德”是下面哪一位历史人物的字号？", choose = {"刘备","曹操","张飞","夏侯惇"}, correct_answer = 2,},

	[10030] = { id = 10010,des = "“破釜沉舟”这个典故说的是谁？", choose = {"项羽","刘邦","关羽","刘备"}, correct_answer = 1,},
}
