require 'config/lang'


Spirits_rebirth = 
{
		{
			-- 第1转的配置
			modelId = 1, 				-- 外观id
			name = 	Lang.Spirits.n1, 	-- 式神名字
			toRenown = 2000, 	-- 转换成的威望值
			maxStages = 1, 		--轮回控制等阶的阶数
			xbCost = { 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 11000, }, 	-- 升星所需仙币
			renownCost = {20, 40, 80, 100, 150, 200, 250, 300, 350, 400, }, 	-- 升星所需威望
			addRate = {0, 1.5, 3, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, }, -- 属性加成
		},
		{
			-- 第2转的配置
			modelId = 2, 				-- 外观id
			name = 	Lang.Spirits.n2, 	-- 式神名字
			toRenown = 20000, 	-- 转换成的威望值
			maxStages = 2, 
			xbCost = { 12000, 13000, 14000, 15000, 16000, 17000, 18000, 19000, 20000, 21000, }, 	-- 升星所需仙币
			renownCost = {200, 400, 600, 800, 1000, 1200, 1600, 2600, 3800, 5000, }, 	-- 升星所需威望
			addRate = {15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, }, -- 属性加成
		},

		{
			-- 第3转的配置
			modelId = 3, 				-- 外观id
			name = 	Lang.Spirits.n3, 	-- 式神名字
			toRenown = 20000, 	-- 转换成的威望值
			maxStages = 3, 
			xbCost = { 22000, 23000, 24000, 25000, 26000, 27000, 28000, 29000, 30000, 31000, }, 	-- 升星所需仙币
			renownCost = {1500, 2000, 2500, 3000, 3500, 4000, 4500, 5000, 5500, 6000, }, 	-- 升星所需威望
			addRate = {30, 31.5, 33, 34.5, 36, 37.5, 39, 40.5, 42, 43.5, }, -- 属性加成
		},

		{
			-- 第4转的配置
			modelId = 4, 				-- 外观id
			name = 	Lang.Spirits.n4, 	-- 式神名字
			toRenown = 20000, 	-- 转换成的威望值
			maxStages = 4, 
			xbCost = { 32000, 33000, 34000, 35000, 36000, 37000, 38000, 39000, 40000, 41000, }, 	-- 升星所需仙币
			renownCost = {4000, 5000, 6000, 7000, 8000, 9000, 10000, 11000, 12000, 13000, }, 	-- 升星所需威望
			addRate = {45, 46.5, 48, 49.5, 51, 52.5, 54, 55.5, 57, 58.5, }, -- 属性加成
		},
		{
			-- 第5转的配置
			modelId = 5, 				-- 外观id
			name = 	Lang.Spirits.n5, 	-- 式神名字
			toRenown = 20000, 	-- 转换成的威望值
			openEquip = {1, 2, 3, 4, 5, 6}, -- 激活装备
			maxEquipLevel = 25, -- 装备最高闪耀级别
			maxStages = 5, 
			xbCost = { 42000, 43000, 44000, 45000, 46000, 47000, 48000, 49000, 50000, 51000, }, 	-- 升星所需仙币
			renownCost = {9000, 11000, 13000, 15000, 17000, 19000, 21000, 23000, 25000, 27000, }, 	-- 升星所需威望
			addRate = {60, 61.5, 63, 64.5, 66, 67.5, 69, 70.5, 72, 73.5, }, -- 属性加成
		},

		{
			-- 第6转的配置
			modelId = 6, 				-- 外观id
			name = 	Lang.Spirits.n6, 	-- 式神名字
			toRenown = 20000, 	-- 转换成的威望值
			maxStages = 6, 
			xbCost = { 52000, 53000, 54000, 55000, 56000, 57000, 58000, 59000, 60000, 61000, }, 	-- 升星所需仙币
			renownCost = {19000, 23000, 27000, 31000, 35000, 39000, 43000, 47000, 51000, 55000, }, 	-- 升星所需威望
			addRate = {75, 76.5, 78, 79.5, 81, 82.5, 84, 85.5, 87, 88.5, }, -- 属性加成
		},

		{
			-- 第7转的配置
			modelId = 7, 				-- 外观id
			name = 	Lang.Spirits.n7, 	-- 式神名字
			toRenown = 20000, 	-- 转换成的威望值
			maxStages = 7, 
			xbCost = { 62000, 63000, 64000, 65000, 66000, 67000, 68000, 69000, 70000, 71000, }, 	-- 升星所需仙币
			renownCost = {61000, 67000, 73000, 79000, 85000, 91000, 97000, 103000, 109000, 115000, }, 	-- 升星所需威望
			addRate = {90, 91.5, 93, 94.5, 96, 97.5, 99, 100.5, 102, 103.5, }, -- 属性加成
		},

		{
			-- 第8转的配置
			modelId = 8, 				-- 外观id
			name = 	Lang.Spirits.n8, 	-- 式神名字
			toRenown = 20000, 	-- 转换成的威望值
			maxStages = 8, 
			xbCost = { 72000, 73000, 74000, 75000, 76000, 77000, 78000, 79000, 80000, 81000, }, 	-- 升星所需仙币
			renownCost = {91000, 99000, 107000, 115000, 123000, 131000, 139000, 147000, 155000, 163000, }, 	-- 升星所需威望
			addRate = {105, 106.5, 108, 109.5, 111, 112.5, 114, 115.5, 117, 118.5, }, -- 属性加成
		},

		{
			-- 第9转的配置
			modelId = 9, 				-- 外观id
			name = 	Lang.Spirits.n9, 	-- 式神名字
			toRenown = 20000, 	-- 转换成的威望值
			maxStages = 9, 
			xbCost = { 82000, 83000, 84000, 85000, 86000, 87000, 88000, 89000, 90000, 91000, }, 	-- 升星所需仙币
			renownCost = {91000, 99000, 107000, 115000, 123000, 131000, 139000, 147000, 155000, 163000, }, 	-- 升星所需威望
			addRate = {120, 121.5, 123, 124.5, 126, 127.5, 129, 130.5, 132, 133.5, }, -- 属性加成
		},

		{
			-- 第10转的配置
			modelId = 10, 				-- 外观id
			name = 	Lang.Spirits.n10, 	-- 式神名字
			toRenown = 20000, 	-- 转换成的威望值
			maxStages = 10, 
			xbCost = { 92000, 93000, 94000, 95000, 96000, 97000, 98000, 99000, 100000, 101000, }, 	-- 升星所需仙币
			renownCost = {91000, 99000, 107000, 115000, 123000, 131000, 139000, 147000, 155000, 163000, }, 	-- 升星所需威望
			openEquip = {1, 2, 3, 4, 5, 6, 7, 8}, -- 激活装备
			addRate = {135, 136.5, 138, 139.5, 141, 142.5, 144, 145.5, 147, 148.5, }, -- 属性加成
		},

}
