require 'config/lang'


Spirits = 
{

	levelLimit = 43,	-- 开启等级
	model = 	--模型id，式神名称
	{
		{ modelId = 1, name = Lang.Spirits.n1, minlevel = 1, maxlevel = 10, },
		{ modelId = 2, name = Lang.Spirits.n2, minlevel = 11, maxlevel = 20, },
		{ modelId = 3, name = Lang.Spirits.n3, minlevel = 21, maxlevel = 30, },
		{ modelId = 4, name = Lang.Spirits.n4, minlevel = 31, maxlevel = 40, },
		{ modelId = 5, name = Lang.Spirits.n5, minlevel = 41, maxlevel = 50, },
	},

	baseAttrs = 	--各级式神属性（生命，攻击，物理防御，精神防御，抗暴击）
	{
		{	518	,	63	,	42	,	42	,	19	,	},			--1级
		{	567	,	69	,	46	,	46	,	20	,	},
		{	641	,	78	,	52	,	52	,	23	,	},
		{	723	,	88	,	59	,	59	,	26	,	},
		{	813	,	99	,	66	,	66	,	29	,	},
		{	920	,	112	,	75	,	75	,	33	,	},
		{	1035	,	126	,	84	,	84	,	37	,	},
		{	1150	,	140	,	93	,	93	,	42	,	},
		{	1282	,	156	,	104	,	104	,	46	,	},
		{	1421	,	173	,	115	,	115	,	51	,	},		--10级
		{	1561	,	190	,	127	,	127	,	56	,	},
		{	1717	,	209	,	139	,	139	,	62	,	},
		{	1873	,	228	,	152	,	152	,	68	,	},
		{	2038	,	248	,	165	,	165	,	74	,	},
		{	2202	,	268	,	179	,	179	,	79	,	},
		{	2374	,	289	,	193	,	193	,	86	,	},
		{	2555	,	311	,	207	,	207	,	92	,	},
		{	2744	,	334	,	223	,	223	,	99	,	},
		{	2933	,	357	,	238	,	238	,	106	,	},
		{	3130	,	381	,	254	,	254	,	113	,	},		--20级
		{	3327	,	405	,	270	,	270	,	120	,	},
		{	3533	,	430	,	287	,	287	,	128	,	},
		{	3747	,	456	,	304	,	304	,	135	,	},
		{	3960	,	482	,	321	,	321	,	143	,	},
		{	4182	,	509	,	339	,	339	,	151	,	},
		{	4404	,	536	,	357	,	357	,	159	,	},
		{	4634	,	564	,	376	,	376	,	167	,	},
		{	4864	,	592	,	395	,	395	,	176	,	},
		{	5102	,	621	,	414	,	414	,	184	,	},
		{	5349	,	651	,	434	,	434	,	193	,	},		--30级
		{	5587	,	680	,	453	,	453	,	202	,	},
		{	5842	,	711	,	474	,	474	,	211	,	},
		{	6088	,	741	,	494	,	494	,	220	,	},
		{	6351	,	773	,	515	,	515	,	229	,	},
		{	6606	,	804	,	536	,	536	,	238	,	},
		{	6877	,	837	,	558	,	558	,	248	,	},
		{	7140	,	869	,	579	,	579	,	258	,	},
		{	7411	,	902	,	601	,	601	,	267	,	},
		{	7690	,	936	,	624	,	624	,	278	,	},
		{	7970	,	970	,	647	,	647	,	288	,	},		--40级
		{	8249	,	1004	,	669	,	669	,	298	,	},
		{	8536	,	1039	,	693	,	693	,	308	,	},
		{	8824	,	1074	,	716	,	716	,	318	,	},
		{	9120	,	1110	,	740	,	740	,	329	,	},
		{	9416	,	1146	,	764	,	764	,	340	,	},
		{	9711	,	1182	,	788	,	788	,	351	,	},
		{	10015	,	1219	,	813	,	813	,	361	,	},
		{	10319	,	1256	,	837	,	837	,	372	,	},
		{	10632	,	1294	,	863	,	863	,	384	,	},
		{	10944	,	1332	,	888	,	888	,	395	,	},		--50级
	},

	-- 升级所需经验
	levelUpExp = 
	{
		140, 250, 460, 760, 1160, 1650, 2240, 2940, 3730, 4630,							--1~10级升级所需
		5640, 6750, 7960, 9290, 10720, 12260, 13910, 15670, 17550, 19530,				--11~20级升级所需
		21630, 23840, 26160, 28590, 31140, 33810, 36590, 39490, 42500, 45630,			--21~30级升级所需
		48870, 52230, 55710, 59310, 63030, 66860, 70820, 74890, 79080, 83400,			--31~40级升级所需
		87830, 92380, 97060, 101850, 106770, 111810, 116970, 122250, 127660, 133190,	--41~50级升级所需
	},

 	-- 升级物品
	levelUpItem =
	{
		-- 物品ID, 获得经验， 代替元宝数量，暴击概率，暴击倍数
		{ itemId = 18603, addExp = 100, ybCost = 10, baojiRate = 10, baojiValue = 2, }, -- 初级式神丹
		{ itemId = 18604, addExp = 300, ybCost = 25, baojiRate = 10, baojiValue = 5, }, -- 中级式神丹
		{ itemId = 18605, addExp = 1000, ybCost = 80, baojiRate = 10, baojiValue = 10, }, -- 高级式神丹
	},

	-----------------------------------------------------------------------------------
	-- 式神装备
	-----------------------------------------------------------------------------------
	equipSlotLevelLimit = { 1, 1, 1, 1, 11, 21, 31, 41, },		-- 式神装备框开启等级（式神等级）
	bnxjExp = 6400,		-- 百年玄晶熔炼值
	equipAttrsType = { 41, 51, 17, 37, 49, 25, 39, 35, },	-- 装备属性类型
	equipItem = 	--类型id，装备名称，装备图标，可否穿戴
	{
		{ type = 1, name = "心若无尘", icon = "icon/interface/others/00400.pd", isEquip = true, Attrsname = '伤害追加', }, 	-- 武器
		{ type = 2, name = "五彩轻纱", icon = "icon/interface/others/00401.pd", isEquip = true, Attrsname = '物理免伤', }, 	-- 轻纱
		{ type = 3, name = "荣耀紫冠", icon = "icon/interface/others/00402.pd", isEquip = true, Attrsname = '生命上限', }, 	-- 头饰
		{ type = 4, name = "踏云仙靴", icon = "icon/interface/others/00403.pd", isEquip = true, Attrsname = '闪避', }, 		-- 靴子
		{ type = 5, name = "玛瑙耳环", icon = "icon/interface/others/00404.pd", isEquip = true, Attrsname = '精神免伤', }, 	-- 耳环
		{ type = 6, name = "情缘项链", icon = "icon/interface/others/00405.pd", isEquip = true, Attrsname = '抗暴击', }, 	-- 项链
		{ type = 7, name = "皇者之戒", icon = "icon/interface/others/00406.pd", isEquip = true, Attrsname = '命中', }, 		-- 戒指
		{ type = 8, name = "圣洁手镯", icon = "icon/interface/others/00407.pd", isEquip = true, Attrsname = '暴击', }, 		-- 手镯
		{ type = 9, name = "百年玄晶", icon = "icon/interface/others/00408.pd", isEquip = false, des = '熔炼后可以获得#ce519cb6400#cffffff点熔炼值#r来源:#cfff000式神探险时有概率获得', }, -- 百年玄晶
		{ type = 10, name = "青铜宝箱", icon = "icon/interface/others/00409.pd", isEquip = false, des = '需消耗一把#ce519cb青铜钥匙#cffffff才能打开，打开后随机获得一件#cfff000极品式神装备#r#cffffff来源:#cfff000式神探险时有概率获得', }, -- 青铜宝箱
	},

	--装备
	equip = 
	{
		-- [1]武器（伤害追加）
		{
			-- [1]白色
			{
				baseExp = 100,		-- 初始熔炼值
				baseAttrs = { 39, 47, },		-- 基础属性范围
				levelAttrs = {	0, 3, 7, 11, 15, 19, 23, 26, 30, 34, 38, 42, }, 		--1~12级属性
				levelUpExp = {	200, 200, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 5000, 10000, 15000, 20000, 25000, 30000, 35000, 40000, 45000, 50000, 55000, }, 	--1~11升级所需铜币
			},

			-- [2]绿色
			{
				baseExp = 200,		-- 初始熔炼值
				baseAttrs = { 116, 139, },		-- 基础属性范围
				levelAttrs = { 0, 11, 23, 34, 46, 57, 69, 80, 92, 103, 115, 127, }, 		--1~12级属性
				levelUpExp = { 400, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 10000, 20000, 30000, 40000, 50000, 60000, 70000, 80000, 90000, 100000, 110000, }, 	--1~11升级所需铜币
			},

			-- [3]蓝色
			{
				baseExp = 400,		-- 初始熔炼值
				baseAttrs = { 308, 370, },		-- 基础属性范围
				levelAttrs = { 0, 31, 62, 92, 123, 154, 185, 216, 246, 277, 308, 339, }, 		--1~12级属性
				levelUpExp = { 1600, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 15000, 30000, 45000, 60000, 75000, 90000, 105000, 120000, 135000, 150000, 165000, }, 	--1~11升级所需铜币
			},

			-- [4]紫色
			{
				baseExp = 800,		-- 初始熔炼值
				baseAttrs = { 886, 950, },		-- 基础属性范围
				levelAttrs = { 0, 88, 177, 265, 354, 442, 531, 620, 708, 797, 885, 974, }, 		--1~12级属性
				levelUpExp = { 6400, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 20000, 40000, 60000, 80000, 100000, 120000, 140000, 160000, 180000, 200000, 220000, }, 	--1~11升级所需铜币
			},


			-- [5]橙色
			{
				baseExp = 1600,		-- 初始熔炼值
				baseAttrs = { 1925, 2020, },		-- 基础属性范围
				levelAttrs = { 0, 193, 385, 578, 770, 963, 1155, 1348, 1541, 1733, 1926, 2118, }, 		--1~12级属性
				levelUpExp = { 12800, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, 6553600, }, 	--1~11升级所需熔炼值
				levelUpMoney = { 25000, 50000, 75000, 100000, 125000, 150000, 175000, 200000, 225000, 250000, 275000, }, 	--1~11升级所需铜币
			},
		},

		-- [2]轻纱（物理免伤）
		{
			-- [1]白色
			{
				baseExp = 100,		-- 初始熔炼值
				baseAttrs = { 39, 47, },		-- 基础属性范围
				levelAttrs = {	0, 3, 7, 11, 15, 19, 23, 26, 30, 34, 38, 42, }, 		--1~12级属性
				levelUpExp = {	200, 200, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 5000, 10000, 15000, 20000, 25000, 30000, 35000, 40000, 45000, 50000, 55000, }, 	--1~11升级所需铜币
			},

			-- [2]绿色
			{
				baseExp = 200,		-- 初始熔炼值
				baseAttrs = { 116, 139, },		-- 基础属性范围
				levelAttrs = { 0, 11, 23, 34, 46, 57, 69, 80, 92, 103, 115, 127, }, 		--1~12级属性
				levelUpExp = { 400, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 10000, 20000, 30000, 40000, 50000, 60000, 70000, 80000, 90000, 100000, 110000, }, 	--1~11升级所需铜币
			},

			-- [3]蓝色
			{
				baseExp = 400,		-- 初始熔炼值
				baseAttrs = { 308, 370, },		-- 基础属性范围
				levelAttrs = { 0, 31, 62, 92, 123, 154, 185, 216, 246, 277, 308, 339, }, 		--1~12级属性
				levelUpExp = { 1600, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 15000, 30000, 45000, 60000, 75000, 90000, 105000, 120000, 135000, 150000, 165000, }, 	--1~11升级所需铜币
			},

			-- [4]紫色
			{
				baseExp = 800,		-- 初始熔炼值
				baseAttrs = { 886, 950, },		-- 基础属性范围
				levelAttrs = { 0, 88, 177, 265, 354, 442, 531, 620, 708, 797, 885, 974, }, 		--1~12级属性
				levelUpExp = { 6400, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 20000, 40000, 60000, 80000, 100000, 120000, 140000, 160000, 180000, 200000, 220000, }, 	--1~11升级所需铜币
			},

			-- [5]橙色
			{
				baseExp = 1600,		-- 初始熔炼值
				baseAttrs = { 1925, 2020, },		-- 基础属性范围
				levelAttrs = { 0, 193, 385, 578, 770, 963, 1155, 1348, 1541, 1733, 1926, 2118, }, 		--1~12级属性
				levelUpExp = { 12800, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, 6553600, }, 	--1~11升级所需熔炼值
				levelUpMoney = { 25000, 50000, 75000, 100000, 125000, 150000, 175000, 200000, 225000, 250000, 275000, }, 	--1~11升级所需铜币
			},
		},

		-- [3]头饰（生命上限）
		{
			-- [1]白色
			{
				baseExp = 100,		-- 初始熔炼值
				baseAttrs = { 380, 460, },		-- 基础属性范围
				levelAttrs = {	0, 40, 80, 120, 160, 200, 230, 270, 310, 350, 390, 430, }, 		--1~12级属性
				levelUpExp = {	200, 200, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 5000, 10000, 15000, 20000, 25000, 30000, 35000, 40000, 45000, 50000, 55000, }, 	--1~11升级所需铜币
			},

			-- [2]绿色
			{
				baseExp = 200,		-- 初始熔炼值
				baseAttrs = { 1150, 1380, },		-- 基础属性范围
				levelAttrs = { 0, 120, 230, 350, 460, 580, 690, 810, 920, 1040, 1150, 1270, }, 		--1~12级属性
				levelUpExp = { 400, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 10000, 20000, 30000, 40000, 50000, 60000, 70000, 80000, 90000, 100000, 110000, }, 	--1~11升级所需铜币
			},

			-- [3]蓝色
			{
				baseExp = 400,		-- 初始熔炼值
				baseAttrs = { 3070, 3680, },		-- 基础属性范围
				levelAttrs = { 310, 620, 920, 1230, 1540, 1850, 2150, 2460, 2770, 3070, 3380, }, 		--1~12级属性
				levelUpExp = { 1600, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 15000, 30000, 45000, 60000, 75000, 90000, 105000, 120000, 135000, 150000, 165000, }, 	--1~11升级所需铜币
			},

			-- [4]紫色
			{
				baseExp = 800,		-- 初始熔炼值
				baseAttrs = { 8830, 9450, },		-- 基础属性范围
				levelAttrs = { 0, 880, 1770, 2650, 3530, 4420, 5300, 6180, 7070, 7950, 8830, 9720, }, 		--1~12级属性
				levelUpExp = { 6400, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 20000, 40000, 60000, 80000, 100000, 120000, 140000, 160000, 180000, 200000, 220000, }, 	--1~11升级所需铜币
			},

			-- [5]橙色
			{
				baseExp = 1600,		-- 初始熔炼值
				baseAttrs = { 19200, 20160, },		-- 基础属性范围
				levelAttrs = { 0, 1920, 3840, 5760, 7680, 9600, 11520, 13440, 15360, 17280, 19200, 21120, }, 		--1~12级属性
				levelUpExp = { 12800, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, 6553600, }, 	--1~11升级所需熔炼值
				levelUpMoney = { 25000, 50000, 75000, 100000, 125000, 150000, 175000, 200000, 225000, 250000, 275000, }, 	--1~11升级所需铜币
			},
		},

		-- [4]靴子（闪避值）
		{
			-- [1]白色
			{
				baseExp = 100,		-- 初始熔炼值
				baseAttrs = { 16, 19, },		-- 基础属性范围
				levelAttrs = {	0, 1, 3, 5, 6, 8, 9, 11, 12, 14, 16, 17, }, 		--1~12级属性
				levelUpExp = {	200, 200, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 5000, 10000, 15000, 20000, 25000, 30000, 35000, 40000, 45000, 50000, 55000, }, 	--1~11升级所需铜币
			},

			-- [2]绿色
			{
				baseExp = 200,		-- 初始熔炼值
				baseAttrs = { 47, 56, },		-- 基础属性范围
				levelAttrs = { 0, 5, 10, 15, 19, 24, 29, 34, 38, 43, 48, 53, }, 		--1~12级属性
				levelUpExp = { 400, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 10000, 20000, 30000, 40000, 50000, 60000, 70000, 80000, 90000, 100000, 110000, }, 	--1~11升级所需铜币
			},

			-- [3]蓝色
			{
				baseExp = 400,		-- 初始熔炼值
				baseAttrs = { 126, 151, },		-- 基础属性范围
				levelAttrs = { 0, 13, 26, 38, 51, 64, 76, 89, 102, 114, 127, 139, }, 		--1~12级属性
				levelUpExp = { 1600, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 15000, 30000, 45000, 60000, 75000, 90000, 105000, 120000, 135000, 150000, 165000, }, 	--1~11升级所需铜币
			},

			-- [4]紫色
			{
				baseExp = 800,		-- 初始熔炼值
				baseAttrs = { 363, 390, },		-- 基础属性范围
				levelAttrs = { 0, 37, 73, 109, 146, 182, 218, 255, 291, 327, 364, 400, }, 		--1~12级属性
				levelUpExp = { 6400, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 20000, 40000, 60000, 80000, 100000, 120000, 140000, 160000, 180000, 200000, 220000, }, 	--1~11升级所需铜币
			},

			-- [5]橙色
			{
				baseExp = 1600,		-- 初始熔炼值
				baseAttrs = { 790, 830, },		-- 基础属性范围
				levelAttrs = { 0, 79, 158, 237, 316, 395, 474, 553, 632, 711, 790, 869, }, 		--1~12级属性
				levelUpExp = { 12800, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, 6553600, }, 	--1~11升级所需熔炼值
				levelUpMoney = { 25000, 50000, 75000, 100000, 125000, 150000, 175000, 200000, 225000, 250000, 275000, }, 	--1~11升级所需铜币
			},
		},

		-- [5]耳环（精神免伤）
		{
			-- [1]白色
			{
				baseExp = 100,		-- 初始熔炼值
				baseAttrs = { 39, 47, },		-- 基础属性范围
				levelAttrs = {	0, 3, 7, 11, 15, 19, 23, 26, 30, 34, 38, 42, }, 		--1~12级属性
				levelUpExp = {	200, 200, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 5000, 10000, 15000, 20000, 25000, 30000, 35000, 40000, 45000, 50000, 55000, }, 	--1~11升级所需铜币
			},

			-- [2]绿色
			{
				baseExp = 200,		-- 初始熔炼值
				baseAttrs = { 116, 139, },		-- 基础属性范围
				levelAttrs = { 0, 11, 23, 34, 46, 57, 69, 80, 92, 103, 115, 127, }, 		--1~12级属性
				levelUpExp = { 400, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 10000, 20000, 30000, 40000, 50000, 60000, 70000, 80000, 90000, 100000, 110000, }, 	--1~11升级所需铜币
			},

			-- [3]蓝色
			{
				baseExp = 400,		-- 初始熔炼值
				baseAttrs = { 308, 370, },		-- 基础属性范围
				levelAttrs = { 0, 31, 62, 92, 123, 154, 185, 216, 246, 277, 308, 339, }, 		--1~12级属性
				levelUpExp = { 1600, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 15000, 30000, 45000, 60000, 75000, 90000, 105000, 120000, 135000, 150000, 165000, }, 	--1~11升级所需铜币
			},

			-- [4]紫色
			{
				baseExp = 800,		-- 初始熔炼值
				baseAttrs = { 886, 950, },		-- 基础属性范围
				levelAttrs = { 0, 88, 177, 265, 354, 442, 531, 620, 708, 797, 885, 974, }, 		--1~12级属性
				levelUpExp = { 6400, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 20000, 40000, 60000, 80000, 100000, 120000, 140000, 160000, 180000, 200000, 220000, }, 	--1~11升级所需铜币
			},

			-- [5]橙色
			{
				baseExp = 1600,		-- 初始熔炼值
				baseAttrs = { 1925, 2020, },		-- 基础属性范围
				levelAttrs = { 0, 193, 385, 578, 770, 963, 1155, 1348, 1541, 1733, 1926, 2118, }, 		--1~12级属性
				levelUpExp = { 12800, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, 6553600, }, 	--1~11升级所需熔炼值
				levelUpMoney = { 25000, 50000, 75000, 100000, 125000, 150000, 175000, 200000, 225000, 250000, 275000, }, 	--1~11升级所需铜币
			},
		},

		-- [6]项链（抗暴击）
		{
			-- [1]白色
			{
				baseExp = 100,		-- 初始熔炼值
				baseAttrs = { 12, 14, },		-- 基础属性范围
				levelAttrs = { 0, 1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, }, 		--1~12级属性
				levelUpExp = {	200, 200, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 5000, 10000, 15000, 20000, 25000, 30000, 35000, 40000, 45000, 50000, 55000, }, 	--1~11升级所需铜币
			},

			-- [2]绿色
			{
				baseExp = 200,		-- 初始熔炼值
				baseAttrs = { 36, 43, },		-- 基础属性范围
				levelAttrs = { 0, 3, 7, 10, 14, 17, 21, 24, 28, 32, 35, 39, }, 		--1~12级属性
				levelUpExp = { 400, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 10000, 20000, 30000, 40000, 50000, 60000, 70000, 80000, 90000, 100000, 110000, }, 	--1~11升级所需铜币
			},

			-- [3]蓝色
			{
				baseExp = 400,		-- 初始熔炼值
				baseAttrs = { 95, 114, },		-- 基础属性范围
				levelAttrs = { 0, 9, 19, 28, 38, 47, 57, 66, 76, 85, 95, 104, }, 		--1~12级属性
				levelUpExp = { 1600, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 15000, 30000, 45000, 60000, 75000, 90000, 105000, 120000, 135000, 150000, 165000, }, 	--1~11升级所需铜币
			},
			-- [4]紫色
			{
				baseExp = 800,		-- 初始熔炼值
				baseAttrs = { 273, 290, },		-- 基础属性范围
				levelAttrs = { 0, 27, 54, 81, 109, 136, 163, 190, 218, 245, 272, 299, }, 		--1~12级属性
				levelUpExp = { 6400, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 20000, 40000, 60000, 80000, 100000, 120000, 140000, 160000, 180000, 200000, 220000, }, 	--1~11升级所需铜币
			},

			-- [5]橙色
			{
				baseExp = 1600,		-- 初始熔炼值
				baseAttrs = { 593, 620, },		-- 基础属性范围
				levelAttrs = { 0, 59, 118, 177, 237, 296, 355, 414, 474, 533, 592, 651, }, 		--1~12级属性
				levelUpExp = { 12800, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, 6553600, }, 	--1~11升级所需熔炼值
				levelUpMoney = { 25000, 50000, 75000, 100000, 125000, 150000, 175000, 200000, 225000, 250000, 275000, }, 	--1~11升级所需铜币
			},
		},

		-- [7]戒指（命中值）
		{
			-- [1]白色
			{
				baseExp = 100,		-- 初始熔炼值
				baseAttrs = { 16, 19, },		-- 基础属性范围
				levelAttrs = {	0, 1, 3, 5, 6, 8, 9, 11, 12, 14, 16, 17, }, 		--1~12级属性
				levelUpExp = {	200, 200, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 5000, 10000, 15000, 20000, 25000, 30000, 35000, 40000, 45000, 50000, 55000, }, 	--1~11升级所需铜币
			},

			-- [2]绿色
			{
				baseExp = 200,		-- 初始熔炼值
				baseAttrs = { 47, 56, },		-- 基础属性范围
				levelAttrs = { 0, 5, 10, 15, 19, 24, 29, 34, 38, 43, 48, 53, }, 		--1~12级属性
				levelUpExp = { 400, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 10000, 20000, 30000, 40000, 50000, 60000, 70000, 80000, 90000, 100000, 110000, }, 	--1~11升级所需铜币
			},

			-- [3]蓝色
			{
				baseExp = 400,		-- 初始熔炼值
				baseAttrs = { 126, 151, },		-- 基础属性范围
				levelAttrs = { 0, 13, 26, 38, 51, 64, 76, 89, 102, 114, 127, 139, }, 		--1~12级属性
				levelUpExp = { 1600, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 15000, 30000, 45000, 60000, 75000, 90000, 105000, 120000, 135000, 150000, 165000, }, 	--1~11升级所需铜币
			},

			-- [4]紫色
			{
				baseExp = 800,		-- 初始熔炼值
				baseAttrs = { 363, 390, },		-- 基础属性范围
				levelAttrs = { 0, 37, 73, 109, 146, 182, 218, 255, 291, 327, 364, 400, }, 		--1~12级属性
				levelUpExp = { 6400, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 20000, 40000, 60000, 80000, 100000, 120000, 140000, 160000, 180000, 200000, 220000, }, 	--1~11升级所需铜币
			},

			-- [5]橙色
			{
				baseExp = 1600,		-- 初始熔炼值
				baseAttrs = { 790, 830, },		-- 基础属性范围
				levelAttrs = { 0, 79, 158, 237, 316, 395, 474, 553, 632, 711, 790, 869, }, 		--1~12级属性
				levelUpExp = { 12800, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, 6553600, }, 	--1~11升级所需熔炼值
				levelUpMoney = { 25000, 50000, 75000, 100000, 125000, 150000, 175000, 200000, 225000, 250000, 275000, }, 	--1~11升级所需铜币
			},
		},

		-- [8]手镯（暴击值）
		{
			-- [1]白色
			{
				baseExp = 100,		-- 初始熔炼值
				baseAttrs = { 12, 14, },		-- 基础属性范围
				levelAttrs = { 0, 1, 2, 3, 5, 6, 7, 8, 9, 11, 12, 13, }, 		--1~12级属性
				levelUpExp = {	200, 200, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 5000, 10000, 15000, 20000, 25000, 30000, 35000, 40000, 45000, 50000, 55000, }, 	--1~11升级所需铜币
			},

			-- [2]绿色
			{
				baseExp = 200,		-- 初始熔炼值
				baseAttrs = { 36, 43, },		-- 基础属性范围
				levelAttrs = { 0, 3, 7, 10, 14, 17, 21, 24, 28, 32, 35, 39, }, 		--1~12级属性
				levelUpExp = { 400, 400, 800, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 10000, 20000, 30000, 40000, 50000, 60000, 70000, 80000, 90000, 100000, 110000, }, 	--1~11升级所需铜币
			},

			-- [3]蓝色
			{
				baseExp = 400,		-- 初始熔炼值
				baseAttrs = { 95, 114, },		-- 基础属性范围
				levelAttrs = { 0, 9, 19, 28, 38, 47, 57, 66, 76, 85, 95, 104, }, 		--1~12级属性
				levelUpExp = { 1600, 1600, 3200, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 15000, 30000, 45000, 60000, 75000, 90000, 105000, 120000, 135000, 150000, 165000, }, 	--1~11升级所需铜币
			},

			-- [4]紫色
			{
				baseExp = 800,		-- 初始熔炼值
				baseAttrs = { 273, 290, },		-- 基础属性范围
				levelAttrs = { 0, 27, 54, 81, 109, 136, 163, 190, 218, 245, 272, 299, }, 		--1~12级属性
				levelUpExp = { 6400, 6400, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, }, 		--1~11升级所需熔炼值
				levelUpMoney = { 20000, 40000, 60000, 80000, 100000, 120000, 140000, 160000, 180000, 200000, 220000, }, 	--1~11升级所需铜币
			},

			-- [5]橙色
			{
				baseExp = 1600,		-- 初始熔炼值
				baseAttrs = { 593, 620, },		-- 基础属性范围
				levelAttrs = { 0, 59, 118, 177, 237, 296, 355, 414, 474, 533, 592, 651, }, 		--1~12级属性
				levelUpExp = { 12800, 12800, 25600, 51200, 102400, 204800, 409600, 819200, 1638400, 3276800, 6553600, }, 	--1~11升级所需熔炼值
				levelUpMoney = { 25000, 50000, 75000, 100000, 125000, 150000, 175000, 200000, 225000, 250000, 275000, }, 	--1~11升级所需铜币
			},
		},
	},

	hjbxVipLimit = 4,	-- 黄金宝箱VIP等级
	hjbxOpenCost = 200,	-- 黄金宝箱费用(元宝/绑元）
	hjbxOpenTimes = 50,	-- 黄金宝箱每天召唤次数上限
	hjbxAward = 		-- 黄金宝箱奖励类型及概率
	{
		-- 类型（熔炼值0，武器1，轻纱2，头饰3，靴4，耳环5，项链6，戒指7，手链8，百年玄晶9，青铜宝箱10），品质（熔炼值0，白1，绿2……），概率十万分比
		{ type = 1, quality = 4, rate = 1000, },
		{ type = 2, quality = 4, rate = 1000, },
		{ type = 3, quality = 4, rate = 1000, },
		{ type = 4, quality = 4, rate = 1000, },
		{ type = 5, quality = 4, rate = 1000, },
		{ type = 6, quality = 4, rate = 1000, },
		{ type = 7, quality = 4, rate = 1000, },
		{ type = 8, quality = 4, rate = 1000, },

		{ type = 1, quality = 5, rate = 250, },
		{ type = 2, quality = 5, rate = 250, },
		{ type = 3, quality = 5, rate = 250, },
		{ type = 4, quality = 5, rate = 250, },
		{ type = 5, quality = 5, rate = 250, },
		{ type = 6, quality = 5, rate = 250, },
		{ type = 7, quality = 5, rate = 250, },
		{ type = 8, quality = 5, rate = 250, },

		{ type = 9, quality = 6, rate = 11250, },
	},

	qtbxKeyItem = 48300,	-- 青铜秘匙物品id
	qtbxAward = 	-- 青铜宝箱奖励类型及概率
	{
		-- 类型（熔炼值0，武器1，轻纱2，头饰3，靴4，耳环5，项链6，戒指7，手链8，百年玄晶9，青铜宝箱10），品质（熔炼值0，白1，绿2……），概率十万分比
		{ type = 1, quality = 3, rate = 11250, },
		{ type = 2, quality = 3, rate = 11250, },
		{ type = 3, quality = 3, rate = 11250, },
		{ type = 4, quality = 3, rate = 11250, },
		{ type = 5, quality = 3, rate = 11250, },
		{ type = 6, quality = 3, rate = 11250, },
		{ type = 7, quality = 3, rate = 11250, },
		{ type = 8, quality = 3, rate = 11250, },

		{ type = 1, quality = 4, rate = 100, },
		{ type = 2, quality = 4, rate = 100, },
		{ type = 3, quality = 4, rate = 100, },
		{ type = 4, quality = 4, rate = 100, },
		{ type = 5, quality = 4, rate = 100, },
		{ type = 6, quality = 4, rate = 100, },
		{ type = 7, quality = 4, rate = 100, },
		{ type = 8, quality = 4, rate = 100, },

		{ type = 1, quality = 5, rate = 25, },
		{ type = 2, quality = 5, rate = 25, },
		{ type = 3, quality = 5, rate = 25, },
		{ type = 4, quality = 5, rate = 25, },
		{ type = 5, quality = 5, rate = 25, },
		{ type = 6, quality = 5, rate = 25, },
		{ type = 7, quality = 5, rate = 25, },
		{ type = 8, quality = 5, rate = 25, },

		{ type = 9, quality = 6, rate = 1125, },
	},

	-- 装备熔炼奖励
	-- 类型（熔炼值0，武器1，轻纱2，头饰3，靴4，耳环5，项链6，戒指7，手链8，百年玄晶9，青铜宝箱10），品质（熔炼值0，白1，绿2……），概率十万分比
	ronglianAward = 
	{
		--[1]白
		{
			{ type = 0, quality = 0, rate = 100000, },
		},

		--[2]绿
		{
			{ type = 0, quality = 0, rate = 88000, },

			{ type = 1, quality = 1, rate = 1250, },
			{ type = 2, quality = 1, rate = 1250, },
			{ type = 3, quality = 1, rate = 1250, },
			{ type = 4, quality = 1, rate = 1250, },
			{ type = 5, quality = 1, rate = 1250, },
			{ type = 6, quality = 1, rate = 1250, },
			{ type = 7, quality = 1, rate = 1250, },
			{ type = 8, quality = 1, rate = 1250, },

			{ type = 1, quality = 2, rate = 250, },
			{ type = 2, quality = 2, rate = 250, },
			{ type = 3, quality = 2, rate = 250, },
			{ type = 4, quality = 2, rate = 250, },
			{ type = 5, quality = 2, rate = 250, },
			{ type = 6, quality = 2, rate = 250, },
			{ type = 7, quality = 2, rate = 250, },
			{ type = 8, quality = 2, rate = 250, },
		},

		--[3]蓝
		{
			{ type = 0, quality = 0, rate = 89900, },

			{ type = 1, quality = 2, rate = 1250, },
			{ type = 2, quality = 2, rate = 1250, },
			{ type = 3, quality = 2, rate = 1250, },
			{ type = 4, quality = 2, rate = 1250, },
			{ type = 5, quality = 2, rate = 1250, },
			{ type = 6, quality = 2, rate = 1250, },
			{ type = 7, quality = 2, rate = 1250, },
			{ type = 8, quality = 2, rate = 1250, },

			{ type = 1, quality = 3, rate = 12, },
			{ type = 2, quality = 3, rate = 12, },
			{ type = 3, quality = 3, rate = 12, },
			{ type = 4, quality = 3, rate = 12, },
			{ type = 5, quality = 3, rate = 13, },
			{ type = 6, quality = 3, rate = 13, },
			{ type = 7, quality = 3, rate = 13, },
			{ type = 8, quality = 3, rate = 13, },
		},

		--[4]紫
		{
			{ type = 0, quality = 0, rate = 90000, },

			{ type = 1, quality = 4, rate = 1250, },
			{ type = 2, quality = 4, rate = 1250, },
			{ type = 3, quality = 4, rate = 1250, },
			{ type = 4, quality = 4, rate = 1250, },
			{ type = 5, quality = 4, rate = 1250, },
			{ type = 6, quality = 4, rate = 1250, },
			{ type = 7, quality = 4, rate = 1250, },
			{ type = 8, quality = 4, rate = 1250, },
		},

		--[5]橙
		{
			{ type = 0, quality = 0, rate = 90000, },

			{ type = 1, quality = 5, rate = 1250, },
			{ type = 2, quality = 5, rate = 1250, },
			{ type = 3, quality = 5, rate = 1250, },
			{ type = 4, quality = 5, rate = 1250, },
			{ type = 5, quality = 5, rate = 1250, },
			{ type = 6, quality = 5, rate = 1250, },
			{ type = 7, quality = 5, rate = 1250, },
			{ type = 8, quality = 5, rate = 1250, },
		},
	},


	-----------------------------------------------------------------------------------
	-- 式神探险
	-----------------------------------------------------------------------------------
	exploreFightLimit = { 1, 10000, 20000, 50000 },		-- 式神探险级别开启战力限制

	explore = 
	{
		-- [1]普通探险
		{
			expAwardTime = 60,		-- 熔炼值奖励频率：秒/次
			expAward = { 1, 2 },	-- 熔炼值奖励范围
			equipAwardTime = 300,	-- 装备奖励频率：秒/次
			equipAward = 			-- 装备奖励类型及概率
			{
				-- 类型（熔炼值0，武器1，轻纱2，头饰3，靴4，耳环5，项链6，戒指7，手链8，百年玄晶9，青铜宝箱10），品质（熔炼值0，白1，绿2……），概率十万分比				{ type = 1, quality = 1, rate = 15, },
				{ type = 1, quality = 1, rate = 10000, },
				{ type = 2, quality = 1, rate = 10000, },
				{ type = 3, quality = 1, rate = 10000, },
				{ type = 4, quality = 1, rate = 10000, },
				{ type = 5, quality = 1, rate = 10000, },
				{ type = 6, quality = 1, rate = 10000, },
				{ type = 7, quality = 1, rate = 10000, },
				{ type = 8, quality = 1, rate = 10000, },

				{ type = 1, quality = 2, rate = 2281, },
				{ type = 2, quality = 2, rate = 2281, },
				{ type = 3, quality = 2, rate = 2281, },
				{ type = 4, quality = 2, rate = 2281, },
				{ type = 5, quality = 2, rate = 2281, },
				{ type = 6, quality = 2, rate = 2281, },
				{ type = 7, quality = 2, rate = 2281, },
				{ type = 8, quality = 2, rate = 2283, },

				{ type = 10, quality = 6, rate = 1750, },
			},
		},

		-- [2]精英探险
		{
			expAwardTime = 60,		-- 熔炼值奖励频率：秒/次
			expAward = { 2, 4 },	-- 熔炼值奖励范围
			equipAwardTime = 300,	-- 装备奖励频率：秒/次
			equipAward = 			-- 装备奖励类型及概率
			{
				{ type = 1, quality = 1, rate = 8625, },
				{ type = 2, quality = 1, rate = 8625, },
				{ type = 3, quality = 1, rate = 8625, },
				{ type = 4, quality = 1, rate = 8625, },
				{ type = 5, quality = 1, rate = 8625, },
				{ type = 6, quality = 1, rate = 8625, },
				{ type = 7, quality = 1, rate = 8625, },
				{ type = 8, quality = 1, rate = 8625, },

				{ type = 1, quality = 2, rate = 3531, },
				{ type = 2, quality = 2, rate = 3531, },
				{ type = 3, quality = 2, rate = 3531, },
				{ type = 4, quality = 2, rate = 3531, },
				{ type = 5, quality = 2, rate = 3531, },
				{ type = 6, quality = 2, rate = 3531, },
				{ type = 7, quality = 2, rate = 3531, },
				{ type = 8, quality = 2, rate = 3533, },

				{ type = 1, quality = 3, rate = 125, },
				{ type = 2, quality = 3, rate = 125, },
				{ type = 3, quality = 3, rate = 125, },
				{ type = 4, quality = 3, rate = 125, },
				{ type = 5, quality = 3, rate = 125, },
				{ type = 6, quality = 3, rate = 125, },
				{ type = 7, quality = 3, rate = 125, },
				{ type = 8, quality = 3, rate = 125, },

				{ type = 10, quality = 6, rate = 1750, },
			},
		},

		-- [3]英雄探险
		{
			expAwardTime = 60,		-- 熔炼值奖励频率：秒/次
			expAward = { 3, 6 },	-- 熔炼值奖励范围
			equipAwardTime = 300,	-- 装备奖励频率：秒/次
			equipAward = 			-- 装备奖励类型及概率
			{
				{ type = 1, quality = 1, rate = 7309, },
				{ type = 2, quality = 1, rate = 7309, },
				{ type = 3, quality = 1, rate = 7309, },
				{ type = 4, quality = 1, rate = 7309, },
				{ type = 5, quality = 1, rate = 7309, },
				{ type = 6, quality = 1, rate = 7309, },
				{ type = 7, quality = 1, rate = 7309, },
				{ type = 8, quality = 1, rate = 7307, },

				{ type = 1, quality = 2, rate = 4781, },
				{ type = 2, quality = 2, rate = 4781, },
				{ type = 3, quality = 2, rate = 4781, },
				{ type = 4, quality = 2, rate = 4781, },
				{ type = 5, quality = 2, rate = 4781, },
				{ type = 6, quality = 2, rate = 4781, },
				{ type = 7, quality = 2, rate = 4781, },
				{ type = 8, quality = 2, rate = 4783, },

				{ type = 1, quality = 3, rate = 188, },
				{ type = 2, quality = 3, rate = 188, },
				{ type = 3, quality = 3, rate = 188, },
				{ type = 4, quality = 3, rate = 188, },
				{ type = 5, quality = 3, rate = 188, },
				{ type = 6, quality = 3, rate = 188, },
				{ type = 7, quality = 3, rate = 188, },
				{ type = 8, quality = 3, rate = 184, },

				{ type = 1, quality = 4, rate = 4, },
				{ type = 2, quality = 4, rate = 4, },
				{ type = 3, quality = 4, rate = 4, },
				{ type = 4, quality = 4, rate = 4, },
				{ type = 5, quality = 4, rate = 4, },
				{ type = 6, quality = 4, rate = 4, },
				{ type = 7, quality = 4, rate = 4, },
				{ type = 8, quality = 4, rate = 2, },

				{ type = 10, quality = 6, rate = 1750, },
			},
		},

		-- [4]炼狱探险
		{
			expAwardTime = 60,		-- 熔炼值奖励频率：秒/次
			expAward = { 4, 8 },	-- 熔炼值奖励范围
			equipAwardTime = 300,	-- 装备奖励频率：秒/次
			equipAward = 			-- 装备奖励类型及概率
			{
				{ type = 1, quality = 1, rate = 5933, },
				{ type = 2, quality = 1, rate = 5933, },
				{ type = 3, quality = 1, rate = 5933, },
				{ type = 4, quality = 1, rate = 5933, },
				{ type = 5, quality = 1, rate = 5933, },
				{ type = 6, quality = 1, rate = 5933, },
				{ type = 7, quality = 1, rate = 5933, },
				{ type = 8, quality = 1, rate = 5929, },

				{ type = 1, quality = 2, rate = 6031, },
				{ type = 2, quality = 2, rate = 6031, },
				{ type = 3, quality = 2, rate = 6031, },
				{ type = 4, quality = 2, rate = 6031, },
				{ type = 5, quality = 2, rate = 6031, },
				{ type = 6, quality = 2, rate = 6031, },
				{ type = 7, quality = 2, rate = 6031, },
				{ type = 8, quality = 2, rate = 6033, },

				{ type = 1, quality = 3, rate = 313, },
				{ type = 2, quality = 3, rate = 313, },
				{ type = 3, quality = 3, rate = 313, },
				{ type = 4, quality = 3, rate = 313, },
				{ type = 5, quality = 3, rate = 313, },
				{ type = 6, quality = 3, rate = 313, },
				{ type = 7, quality = 3, rate = 313, },
				{ type = 8, quality = 3, rate = 309, },

				{ type = 1, quality = 4, rate = 5, },
				{ type = 2, quality = 4, rate = 5, },
				{ type = 3, quality = 4, rate = 5, },
				{ type = 4, quality = 4, rate = 5, },
				{ type = 5, quality = 4, rate = 5, },
				{ type = 6, quality = 4, rate = 5, },
				{ type = 7, quality = 4, rate = 5, },
				{ type = 8, quality = 4, rate = 5, },

				{ type = 10, quality = 6, rate = 1750, },
			},
		},
	},

	maxExploreTime = 3 *24 * 60 * 60,				-- 最大探险时间
	addExploreTime = 1 * 60 * 60,					-- 每次增加探险时间
	addExploreTimeMoney = { 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, },	-- 增加探险时间所需元宝（第1次，第2次...），次数超过列表大小的取最后一个值
}
