require 'config/lang'


-- 奖励类型
--[[
qatEquipment=0,             //物品或者装备
qatRootExp = 1,	            //真气
qatExp = 2,                	//角色经验值
qatGuildContribution = 3,	//帮派贡献值
qatZYContribution = 4,		//阵营贡献
qatBindMoney = 5,           //绑定银两
qatMoney = 6,	            //银两
qatLiJin = 7,	            //绑定天珠
qatTitle = 8,	            //称谓
qatSkill = 9,	            //技能
qatAchievePoint =11,        //成就点
};
--]]

--[[
	loginAwards :
	type : 类型
	value : 值，如果是物品类型，这个表示物品的数量
	id : 如果是物品类型，这个表示物品的itemid
	strong : 如果是物品，这个表示物品的强化值,默认是0
	bind ：如果是物品，这个表示物品的绑定属性，0表示非绑定，1表示非绑定，默认是0
]]

--[[
yuanbaos	需要充值的天珠

ipTitle	专属称号id

dayFubenAdd 增加的日常副本次数

jjcPlayAdd	增加的挑战竞技场（仙斗会）次数

jjcBuyAdd	增加的购买竞技场（仙斗会）次数

moneyTreeAdd	增加的聚宝盆(摇钱树)次数

dayQuestAdds	增加的日常副本次数(猎骑战场_灵宠宝岛_守护玄女_无尽秘藏_仙羽秘境)

payQuestupdates	增加的悬赏任务刷新次数

payQuestLimit	增加悬赏任务的完成数的上限

friendAdd		增加的好友上限

enemyAdd		增加的仇人上限

blackAdd		增加的黑名单上限

sendBoxKey	增加每天赠送宝箱钥匙的次数上限

receiveBoxKey	增加每天收取宝箱钥匙的次数上限

stroryFubenAdd	增加每个剧情副本每日的挑战次数上限

sendFlowerAdd 增加每天可赠送玫瑰的次数上限

txt			vip特权描述(每行以_分隔)

telePort	速传次数（-1表示不限次数）

tongtianReset	增加通天试炼每日重置次数

tongtianPushCd	通天试炼扫荡是否有CD（1没有 0有）

signReward	vip签到奖励掉落包

vipPrize		vip礼包
exteraSignNum 	每个月补签次数

treasurePractice 增加法宝修炼总次数

chatWait 聊天CD限制,1表示聊天无CD限制


--]]

VIPConfig = {
		yuanbaos = {100,500,1000,2000,5000,10000,20000,50000,100000,200000,},
		vipTitle = {1,2,3,4,5,6,7,8,9,10,},
		dayFubenAdd = {[1] = {},[2] = {},[3] = {[1] = 1,},[4] = {[1] = 1,},[5] = {[1] = 1,[2] = 1,},[6] = {[1] = 1,[2] = 1,[3] = 1,},[7] = {[1] = 1,[2] = 1,[3] = 1,},[8] = {[1] = 1,[2] = 1,[3] = 1,[4] = 1,[5] = 1,},[9] = {[1] = 1,[2] = 1,[3] = 1,[4] = 1,[5] = 1,},[10] = {[1] = 1,[2] = 1,[3] = 1,[4] = 1,[5] = 1,},},
		jjcPlayAdd = {1,2,4,6,9,12,15,18,21,25,},
		jjcBuyAdd = {1,2,4,6,9,12,15,18,21,25,},
		moneyTreeAdd = {5,15,35,55,75,95,115,135,165,195,},
		dayQuestAdds = {0,0,0,0,0,0,0,0,0,0,},
		payQuestupdates = {0,0,0,0,0,0,0,0,0,0,},
		payQuestLimit = {0,0,0,0,0,0,0,0,0,0,},
		friendAdd = {5,10,15,20,25,30,35,40,45,50,},
		enemyAdd = {5,10,15,20,25,30,35,40,45,50,},
		blackAdd = {5,10,15,20,25,30,35,40,45,50,},
		sendBoxKey = {0,1,1,2,2,3,3,4,4,5,},
		receiveBoxKey = {1,2,3,4,5,6,7,8,9,10,},
		stroryFubenAdd = {0,1,1,1,2,2,2,3,3,3,},
		sendFlowerAdd = {2,5,10,15,20,30,40,55,70,90,},
		txt = {"每天仙斗会挑战次数增加为6次_每天仙斗会额外次数的购买机会增加为4次_每天聚宝盆的聚宝次数增加为10次_好友上限增加为55_仇人上限增加为55_黑名单上限增加为55_每天好友宝箱钥匙收取上限增加为11次_每天伙伴赠送蜜饯次数增加为12次_每天免费速传次数增加为10次_签到奖励中的补签次数增加为6次","每天赤影传说中的剧情副本通关次数增加为4_每天好友宝箱钥匙赠送上限增加为6次_每天仙斗会挑战次数增加为7次_每天仙斗会额外次数的购买机会增加为5次_每天聚宝盆的聚宝次数增加为20次_好友上限增加为60_仇人上限增加为60_黑名单上限增加为60_每天好友宝箱钥匙收取上限增加为12次_每天伙伴赠送蜜饯次数增加为15次_每天免费速传次数增加为20次_签到奖励中的补签次数增加为7次","聊天频道中可任意发言，取消聊天信息发送间隔_每天法宝修炼总次数增加为15次_每天日常副本-昆仑讹兽的通关次数增加为3次_每天赤影传说中的剧情副本通关次数增加为4次_每天好友宝箱钥匙赠送上限增加为6次_每天仙斗会挑战次数增加为9次_每天仙斗会额外次数的购买机会增加为7次_每天聚宝盆的聚宝次数增加为40次_好友上限增加为65_仇人上限增加为65_黑名单上限增加为65_每天好友宝箱钥匙收取上限增加为13次_每天伙伴赠送蜜饯次数增加为20次_每天免费速传次数增加为30次_签到奖励中的补签次数增加为9次","通天试炼可以立即完成扫荡，无需等待扫荡CD_聊天频道中可任意发言，取消聊天信息发送间隔_每天法宝修炼总次数增加为15次_每天日常副本-昆仑讹兽的通关次数增加为3次_每天赤影传说中的剧情副本通关次数增加为4次_每天好友宝箱钥匙赠送上限增加为7次_每天仙斗会挑战次数增加为11次_每天仙斗会额外次数的购买机会增加为9次_每天聚宝盆的聚宝次数增加为60次_好友上限增加为70_仇人上限增加为70_黑名单上限增加为70_每天好友宝箱钥匙收取上限增加为14次_每天伙伴赠送蜜饯次数增加为25次_每天免费速传次数增加为40次_签到奖励中的补签次数增加为11次","每天日常副本-山精海怪的通关次数增加为3次_通天试炼可以立即完成扫荡，无需等待扫荡CD_聊天频道中可任意发言，取消聊天信息发送间隔_每天法宝修炼总次数增加为20次_每天日常副本-昆仑讹兽的通关次数增加为3次_每天赤影传说中的剧情副本通关次数增加为5次_每天好友宝箱钥匙赠送上限增加为7次_每天仙斗会挑战次数增加为14次_每天仙斗会额外次数的购买机会增加为12次_每天聚宝盆的聚宝次数增加为80次_好友上限增加为75_仇人上限增加为75_黑名单上限增加为75_每天好友宝箱钥匙收取上限增加为15次_每天伙伴赠送蜜饯次数增加为30次_每天免费速传次数增加为50次_签到奖励中的补签次数增加为14次","每天日常副本-仙羽秘境的通关次数增加为3次_每天日常副本-山精海怪的通关次数增加为3次_通天试炼可以立即完成扫荡，无需等待扫荡CD_聊天频道中可任意发言，取消聊天信息发送间隔_每天法宝修炼总次数增加为20次_每天日常副本-昆仑讹兽的通关次数增加为3次_每天赤影传说中的剧情副本通关次数增加为5次_每天好友宝箱钥匙赠送上限增加为8次_每天仙斗会挑战次数增加为17次_每天仙斗会额外次数的购买机会增加为15次_每天聚宝盆的聚宝次数增加为100次_好友上限增加为80_仇人上限增加为80_黑名单上限增加为80_每天好友宝箱钥匙收取上限增加为16次_每天伙伴赠送蜜饯次数增加为40次_每天可无限次免费速传_签到奖励中的补签次数增加为17次","每天通天试炼的重置次数增加为3次_每天日常副本-仙羽秘境的通关次数增加为3次_每天日常副本-山精海怪的通关次数增加为3次_通天试炼可以立即完成扫荡，无需等待扫荡CD_聊天频道中可任意发言，取消聊天信息发送间隔_每天法宝修炼总次数增加为28次_每天日常副本-昆仑讹兽的通关次数增加为3次_每天赤影传说中的剧情副本通关次数增加为5次_每天好友宝箱钥匙赠送上限增加为8次_每天仙斗会挑战次数增加为20次_每天仙斗会额外次数的购买机会增加为18次_每天聚宝盆的聚宝次数增加为120次_好友上限增加为85_仇人上限增加为85_黑名单上限增加为85_每天好友宝箱钥匙收取上限增加为17次_每天伙伴赠送蜜饯次数增加为50次_每天可无限次免费速传_签到奖励中的补签次数增加为20次","每天日常副本-守护玄女的通关次数增加为3次_每天日常副本-无尽秘藏的通关次数增加为3次_每天通天试炼的重置次数增加为3次_每天日常副本-仙羽秘境的通关次数增加为3次_每天日常副本-山精海怪的通关次数增加为3次_通天试炼可以立即完成扫荡，无需等待扫荡CD_聊天频道中可任意发言，取消聊天信息发送间隔_每天法宝修炼总次数增加为28次_每天日常副本-昆仑讹兽的通关次数增加为3次_每天赤影传说中的剧情副本通关次数增加为6次_每天好友宝箱钥匙赠送上限增加为9次_每天仙斗会挑战次数增加为23次_每天仙斗会额外次数的购买机会增加为21次_每天聚宝盆的聚宝次数增加为140次_好友上限增加为90_仇人上限增加为90_黑名单上限增加为90_每天好友宝箱钥匙收取上限增加为18次_每天伙伴赠送蜜饯次数增加为65次_每天可无限次免费速传_签到奖励中的补签次数增加为23次","每天日常副本-守护玄女的通关次数增加为3次_每天日常副本-无尽秘藏的通关次数增加为3次_每天通天试炼的重置次数增加为3次_每天日常副本-仙羽秘境的通关次数增加为3次_每天日常副本-山精海怪的通关次数增加为3次_通天试炼可以立即完成扫荡，无需等待扫荡CD_聊天频道中可任意发言，取消聊天信息发送间隔_每天法宝修炼总次数增加为40次_每天日常副本-昆仑讹兽的通关次数增加为3次_每天赤影传说中的剧情副本通关次数增加为6次_每天好友宝箱钥匙赠送上限增加为9次_每天仙斗会挑战次数增加为26次_每天仙斗会额外次数的购买机会增加为24次_每天聚宝盆的聚宝次数增加为170次_好友上限增加为95_仇人上限增加为95_黑名单上限增加为95_每天好友宝箱钥匙收取上限增加为19次_每天伙伴赠送蜜饯次数增加为80次_每天可无限次免费速传_签到奖励中的补签次数增加为26次","每天日常副本-守护玄女的通关次数增加为3次_每天日常副本-无尽秘藏的通关次数增加为3次_每天通天试炼的重置次数增加为4次_每天日常副本-仙羽秘境的通关次数增加为3次_每天日常副本-山精海怪的通关次数增加为3次_通天试炼可以立即完成扫荡，无需等待扫荡CD_聊天频道中可任意发言，取消聊天信息发送间隔_每天法宝修炼总次数增加为40次_每天日常副本-昆仑讹兽的通关次数增加为3次_每天赤影传说中的剧情副本通关次数增加为6次_每天好友宝箱钥匙赠送上限增加为10次_每天仙斗会挑战次数增加为30次_每天仙斗会额外次数的购买机会增加为28次_每天聚宝盆的聚宝次数增加为200次_好友上限增加为100_仇人上限增加为100_黑名单上限增加为100_每天好友宝箱钥匙收取上限增加为20次_每天伙伴赠送蜜饯次数增加为100次_每天可无限次免费速传_签到奖励中的补签次数增加为30次",},
		telePort = {10,20,30,40,50,-1,-1,-1,-1,-1,},
		tongtianReset = {0,0,0,0,0,0,1,1,1,2,},
		tongtianPushCd = {0,0,0,1,1,1,1,1,1,1,},
		signReward = {0,0,0,0,0,0,0,0,0,0,},
		exteraSignNum = {1,2,4,6,9,12,15,18,21,25,},
		vipPrize = {
 		{{id = 26101,bind = 0,tp = 2,n = 1,},{id = 26111,bind = 0,tp = 2,n = 1,},},
 		{{id = 26101,bind = 0,tp = 2,n = 2,},{id = 26111,bind = 0,tp = 2,n = 2,},},
 		{{id = 26101,bind = 0,tp = 2,n = 3,},{id = 26111,bind = 0,tp = 2,n = 3,},},
 		{{id = 26101,bind = 0,tp = 2,n = 4,},{id = 26111,bind = 0,tp = 2,n = 4,},},
 		{{id = 26101,bind = 0,tp = 2,n = 5,},{id = 26111,bind = 0,tp = 2,n = 5,},},
 		{{id = 26101,bind = 0,tp = 2,n = 6,},{id = 26111,bind = 0,tp = 2,n = 6,},},
 		{{id = 26101,bind = 0,tp = 2,n = 7,},{id = 26111,bind = 0,tp = 2,n = 7,},},
 		{{id = 26101,bind = 0,tp = 2,n = 8,},{id = 26111,bind = 0,tp = 2,n = 8,},},
 		{{id = 26101,bind = 0,tp = 2,n = 9,},{id = 26111,bind = 0,tp = 2,n = 9,},},
 		{{id = 26101,bind = 0,tp = 2,n = 10,},{id = 26111,bind = 0,tp = 2,n = 10,},},

 		},
		treasurePractice = {0,0,5,5,10,10,18,18,30,30,},
		chatWait = {0,0,1,1,1,1,1,1,1,1,},
 	}

YellowVip = 
{
	firstAward = 28208,	-- 黄钻新手礼包的物品id
	dayAward = {18293,18294,18295,18296,18297,18298,18299,28200},	-- 每日礼包的物品id，共8个，对应8个vip等级
	dayAwardYear = {18710,18710,18710,18710,18710,18710,18710,18710,},	-- 年费vip每日礼包的物品id，共8个，对应8个vip等级
	levelAward = {28201,28202,28203,28204,28205,28206,28207,}, -- 等级礼包，第一个是10级礼包，类推
	petItemId = 38203,			-- 伙伴id
	bbtItemid = 11700,		-- 开通棒棒糖活动的物品id
	bbtOther = 18610,
}

BlueVip = 
{
    firstAward = 48234,	-- 蓝钻新手礼包的物品id
	dayAward = {48223,48224,48225,48226,48227,48228,48229,},	-- 每日礼包的物品id，共7个，对应7个每日等级
	dayAwardYear = {48235,48236,48237,48238,48239,48240,48241,},	-- 年费蓝钻每日礼包的物品id，共7个，对应7个年费等级
	levelAward = {48231,48232,48233,48242,48243,48244,48245,}, -- 等级礼包，第一个是10级礼包，类推
	dating = 48283,
	petItemId = 38204,			-- 伙伴id
	practice = { -- 打坐的经验和真气加成
		expAdd = 0.3,
		rootAdd = 0.3,
	},
}

--充值金额
rechargeLimitNum = {1, 500, 2000, 5000, 10000, 20000, 30000}
-- 首充礼包的物品id，1-6个是对应不同充值金额的物品id，最后一个是领取的翅膀id
firstAwardVip = {18220, 18221,18222,18223,18224,18225,18226, 11402}

--add wupeng 首冲子礼包配置
firstsmallAwardVip = {64740, 64741, 64742}

-- 第二轮充值礼包的物品id，1-8个都是对应不同充值天珠的物品id
round2AwardVip = {48246, 48247,48248,48249,48250,48251,48252,48253}

--add wupeng 蓝钻尊贵礼包奖励
NobleblueAward = 64730
--add wupeng QQ浏览器奖励以及活动id
QQAwardId = 64811
QQID = 31

--add wupeng 微信CDkey奖励,活动id以及key
WeiXinAwardId = 64842
WXID = 998
WXkey = "20qz14"
